/******************************************************************************

版权所有 (C), 刘剑个人文件

******************************************************************************
文 件 名 : LiaPrintInterProcSever.c
版 本 号 : 初稿
作 者 : liujian
生成日期 : 2015/10/02
最近修改 :
功能描述 :
函数列表 :
修改历史 :
1.日 期 : 2015/10/02
作 者 : liujian
修改内容 : 创建文件

******************************************************************************/

/*----------------------------------------------*
* 包含头文件 *
*----------------------------------------------*/
#include "LiaPrintInterProcSever.h"
/*----------------------------------------------*
* 外部变量说明 *
*----------------------------------------------*/

/*----------------------------------------------*
* 外部函数原型说明 *
*----------------------------------------------*/

/*----------------------------------------------*
* 内部函数原型说明 *
*----------------------------------------------*/

/*----------------------------------------------*
* 全局变量 *
*----------------------------------------------*/

/*----------------------------------------------*
* 模块级变量 *
*----------------------------------------------*/

/*----------------------------------------------*
* 常量定义 *
*----------------------------------------------*/

/*----------------------------------------------*
* 宏定义 *
*----------------------------------------------*/

Int32 main(int argc, char **argv)
{
	char pi8ttyName[32];
	char i32ReadBuf[128];
	int i32fd = -1;
	//i32fd = dup(STDOUT_FILENO);
	//close(STDOUT_FILENO);
	//fcntl(i32fd,O_RDWR);
	char i8WritBuf[MAX_READ_BUF];

	
	memset(i32ReadBuf, 0x0, MAX_READ_BUF);
	memset(i8WritBuf, 0x0, MAX_READ_BUF);
	sprintf(i8WritBuf, "%s", ttyname(STDOUT_FILENO));
	Lia_Fifo_Init(FIFO_FROM_CLIENT_TO_SEVER, FIFO_MODE);
	Lia_Fifo_Write(FIFO_FROM_CLIENT_TO_SEVER, i8WritBuf, MAX_READ_BUF);
	printf("1111\n");
	//dup2(i32fd, STDOUT_FILENO);
	//memcpy(pi8ttyName, ttyname(STDOUT_FILENO),32);
	//printf("tty name is %s\n", pi8ttyName);
	//close(STDOUT_FILENO);
	//i32fd=open(pi8ttyName,O_RDWR);
	//printf("i32fd:%d\n", i32fd);
	while (1)
	{
#if 0
		printf("111\n");
		read(i32fd,i32ReadBuf,128);
		printf("i32ReadBuf:%s", i32ReadBuf);
#endif
		//write(i32fd,"1111",4);
		sleep(1);
	}

	return 0;
}
