/******************************************************************************

版权所有 (C), 刘剑个人文件

******************************************************************************
文 件 名 : LiaIPCUsingSignal.c
版 本 号 : 初稿
作 者 : liujian
生成日期 : 2015/09/15
最近修改 :
功能描述 :
函数列表 :
修改历史 :
1.日 期 : 2015/09/15
作 者 : liujian
修改内容 : 创建文件

******************************************************************************/

/*----------------------------------------------*
* 包含头文件 *
*----------------------------------------------*/
#include "LiaIPCUsingSignal.h"
/*----------------------------------------------*
* 外部变量说明 *
*----------------------------------------------*/

/*----------------------------------------------*
* 外部函数原型说明 *
*----------------------------------------------*/

/*----------------------------------------------*
* 内部函数原型说明 *
*----------------------------------------------*/
static void Lia_SignalProcess(Int32 i32Signo, siginfo_t * pSigInfo, void * pFlag);
/*----------------------------------------------*
* 全局变量 *
*----------------------------------------------*/

/*----------------------------------------------*
* 模块级变量 *
*----------------------------------------------*/

/*----------------------------------------------*
* 常量定义 *
*----------------------------------------------*/

/*----------------------------------------------*
* 宏定义 *
*----------------------------------------------*/

Int32 main(int argc, Int8 **argv)
{
	pid_t ParentPid, ChildPid;
	Int32 i32SendData = 110;
	Lia_RecieveSignalProcess(SIGRTMAX - 1, Lia_SignalProcess);

	if ((ChildPid = fork()) < 0)
	{
		printf("fork error!\n");
	}
	if (0 != ChildPid)
	{
		printf("ChildPid:%d\n", ChildPid);
	}
	if (0 == ChildPid)
	{
		sleep(3);
		printf("SIGRTMAX:%d\n", SIGRTMAX);
		sleep(3);

		exit(0);
	}
	Lia_SendSigWithPara(ChildPid, SIGRTMAX - 1, &i32SendData);
	printf("1111\n");
	waitpid(ChildPid, NULL, 0);

	return 0;
}

/*****************************************************************************
函 数 名 : Lia_SignalProcess
功能描述 : 对于接收到的信号的处理函数
输入参数 : i32Signo 表示收到的信号
输入参数 : pSigInfo 表示信号信息
输入参数 : pFlag
输出参数 : 无
返 回 值 : 0表示成功
负数表示失败
调用函数 :
被调函数 :

修改历史 :
1.日 期 : 2015/09/15
作 者 : liujian
修改内容 : 新生成函数

*****************************************************************************/
static void Lia_SignalProcess(Int32 i32Signo, siginfo_t * pSigInfo, void * pFlag)
{
	printf("receive data :%d\n", *(int *)(pSigInfo->si_value.sival_ptr));

	return;
}

