/******************************************************************************

版权所有 (C), 刘剑个人文件

******************************************************************************
文 件 名 : LiaTestSigchild.c
版 本 号 : 初稿
作 者 : liujian
生成日期 : 2015/10/12
最近修改 :
功能描述 :测试SIGCHLD产生的原因
函数列表 :
修改历史 :
1.日 期 : 2015/10/12
作 者 : liujian
修改内容 : 创建文件

******************************************************************************/

/*----------------------------------------------*
* 包含头文件 *
*----------------------------------------------*/
#include "LiaTestSigchild.h"
/*----------------------------------------------*
* 外部变量说明 *
*----------------------------------------------*/

/*----------------------------------------------*
* 外部函数原型说明 *
*----------------------------------------------*/

/*----------------------------------------------*
* 内部函数原型说明 *
*----------------------------------------------*/
static void SigchldProcess(int Signo, siginfo_t *Siginfo, void *flag);

/*----------------------------------------------*
* 全局变量 *
*----------------------------------------------*/

/*----------------------------------------------*
* 模块级变量 *
*----------------------------------------------*/

/*----------------------------------------------*
* 常量定义 *
*----------------------------------------------*/

/*----------------------------------------------*
* 宏定义 *
*----------------------------------------------*/

int main(int argc, char **argv)
{
	pid_t pid = -1;

	Lia_RecieveSignalProcess(SIGCHLD, SigchldProcess);
	if ((pid=fork())<0)//生成一个子进程
	{
		printf("fork error!\n");
	}
	if (0==pid)
	{
		printf("child process\n");
		exit(0);
	}
	sleep(10);

	return 0;
}

static void SigchldProcess(int Signo, siginfo_t *Siginfo, void *flag) 
{
		switch (Siginfo->si_code)
		{
		case CLD_EXITED:
			printf("CLD_EXITED\n");
			break;
		case CLD_KILLED:
			printf("CLD_KILLED\n");
			break;
		case CLD_DUMPED:
			printf("CLD_DUMPED\n");
			break;
		case CLD_STOPPED:
			printf("CLD_STOPPED\n");
			break;
		case CLD_TRAPPED:
			printf("CLD_TRAPPED\n");
			break;
		case CLD_CONTINUED:
			printf("CLD_CONTINUED\n");
			break;
		default:
			printf("Others\n");
			break;
		}
	return;
}